[
  {
    "id": "p1",
    "name": "RAZ DC15000 Disposable Vape | 15,000 Puffs (Boost) | Mega HD Screen",
    "category": "Disposables",
    "description": "Experience the Future of Vaping with the RAZ DC15000 (Boost). Elevate your vaping journey with a powerhouse device built for flavor lovers who want intense performance. Wrapped in premium genuine leather, it feels as luxurious as it performs.\n\nPuff Capacity\n- 15,000 Puffs (Boost Mode): Unleash maximum flavor and massive vapor clouds with enhanced power.\n\nInnovative Mega HD Screen\n- E-Liquid Indicator: Know exactly how much juice is left.\n- Battery Life Monitor: Track your 800mAh battery at a glance.\n- Vaping Animations: High-quality fire and gear animations while you puff.\n\nKey Features\n- Pre-filled E-liquid for long-lasting use\n- Nicotine Strength: 5% (50mg)\n- Advanced Mesh Coil for pure, \"bangin\" flavor\n- USB-C Fast Charging (cable not included)\n- Premium transparent shell with textured leather finish\n\nAvailable Flavors\n- Bangin Sour Berries\n- Miami Mint\n- Blueberry Watermelon\n- Wintergreen",
    "images": [
      "images/products/Razz/Razz1.png",
      "images/products/Razz/Razz2.png",
      "images/products/Razz/Razz3.png",
      "images/products/Razz/Razz4.png",
      "images/products/Razz/Razz5.png"
    ],
    "rating": 4.5,
    "onSale": true
  },
  {
    "id": "p2",
    "name": "RAZ DC25000 Disposable Vape | 25,000 Puffs (Normal) | Mega HD Screen",
    "category": "Disposables",
    "description": "Experience the Future of Vaping with the RAZ DC25000 (Normal). Designed for longevity and consistency, this device is perfect for everyday vapers who want smooth, reliable draws for weeks. Wrapped in premium genuine leather for a luxury feel.\n\nPuff Capacity\n- 25,000 Puffs (Normal Mode): Smooth, consistent performance built to last.\n\nInnovative Mega HD Screen\n- E-Liquid Indicator: Stay aware and avoid dry hits.\n- Battery Life Monitor: Track your 800mAh battery level.\n- Vaping Animations: Dynamic fire and gear animations while you puff.\n\nKey Features\n- Pre-filled E-liquid for long-lasting use\n- Nicotine Strength: 5% (50mg)\n- Advanced Mesh Coil for pure, \"bangin\" flavor\n- USB-C Fast Charging (cable not included)\n- Premium transparent shell with textured leather finish\n\nAvailable Flavors\n- Bangin Sour Berries\n- Miami Mint\n- Blueberry Watermelon\n- Wintergreen",
    "images": [
      "images/products/Razz/Razz1.png",
      "images/products/Razz/Razz2.png",
      "images/products/Razz/Razz3.png",
      "images/products/Razz/Razz4.png",
      "images/products/Razz/Razz5.png"
    ],
    "rating": 4.7,
    "onSale": true
  },
  {
    "id": "p3",
    "name": "Air Bar AURA XL Disposable Vape | 30,000 Puffs | Mega HD Display & PTC Chip",
    "category": "Disposables",
    "description": "The Ultimate Vaping Experience: Air Bar AURA XL The Air Bar AURA XL is a next-generation disposable device designed for vapers who prioritize both longevity and cutting-edge technology. Featuring a massive 27mL pre-filled e-liquid capacity and an advanced 800mAh rechargeable battery, this device is built to last through thousands of satisfying draws.\n\nIntelligent Features & Display\nStay informed with the built-in XL HD screen, which provides real-time monitoring of your essential stats:\n\n- E-Liquid Level Indicator: Easily track how much juice remains.\n\n- Battery Monitoring: Know exactly when it's time to recharge via the USB-C port.\n\n- Dynamic Animations: Interactive visuals engage every time you take a puff.\n\nCustomizable Performance\nDual Vaping Modes: Choose between Regular Mode for maximum longevity (up to 25,000 puffs) or switch to a more intense experience.\n\nAdjustable Airflow: Fine-tune your draw from a tight MTL (mouth-to-lung) to a more open, restricted DTL (direct-to-lung) hit.\n\nAdvanced PTC Chip: Integrated technology ensures consistent flavor and performance while preventing overheating.\n\nProduct Specifications:\n- Puff Count: Up to 25,000 Puffs.\n- E-Liquid Capacity: 27mL.\n- Nicotine Strength: 5% (50mg).\n- Coil System: High-performance Mesh Coil for rich, pure flavor.\n- Charging: Type-C Fast Charging.\n\nTop Flavors in this Lineup:\n- Sour Apple Ice: A tart apple blast with a cooling menthol finish.\n- Miami Mint: Crisp, refreshing, and smooth spearmint.\n- Blueberry Ice: Sweet mountain blueberries with a chilled exhale.",
    "images": [
      "images/products/Aura/aura2.jpeg",
      "images/products/Aura/aura1.jpeg",
      "images/products/Aura/aura3.jpeg",
      "images/products/Aura/aura4.jpeg",
      "images/products/Aura/aura5.jpeg",
      "images/products/Aura/aura6.jpeg",
      "images/products/Aura/aura7.jpg"
    ],
    "rating": 4.8,
    "onSale": true,
    "isNew": true
  },
  {
    "id": "p4",
    "name": "RAZ LTX 30,000 Puff Limited Edition Disposable | Mega HD Screen | Dual Power Modes",
    "category": "Disposables",
    "description": "Push the Boundaries of Vaping with the RAZ LTX 30,000 The RAZ LTX 30,000 is the pinnacle of disposable technology, engineered for vapers who never want to run out of flavor. This massive-capacity device combines a sophisticated genuine leather grip with a futuristic Mega HD Screen, providing a premium feel and total control over your vaping experience.\n\nThe Largest HD Screen in the Game\nStay ahead of the curve with a full-color, high-definition interface that does more than just show numbers. The Mega HD Screen features:\n\nDynamic Fire Animations: Visual flames and gears that react to every draw.\n\nReal-Time Monitoring: Keep a precise eye on your remaining E-liquid and Battery Life.\n\nMode Indicators: Easily see if you are in high-power \"Boost\" mode or long-lasting \"Normal\" mode.\n\nAdvanced Performance Features\n30,000 Puff Capacity: Optimized for longevity, providing weeks of use in Normal Mode.\n\nEnhanced Boost Mode: Switch to Boost for intensified flavor and massive vapor production (approx. 18,000 puffs).\n\nPremium Mesh Coil Technology: Dual mesh coils ensure that the last puff tastes as fresh and vibrant as the first.\n\nUSB-C Fast Charging: Minimize downtime with rapid recharging for the integrated 800mAh battery.\n\nSpecifications at a Glance:\nMax Puffs: 30,000 (Normal Mode)\nNicotine Strength: 5% (50mg)\nCharging: Type-C Rechargeable\nFinish: Transparent shell with Genuine Leather accents\nDisplay: Full HD Smart Screen\n\nFeatured Flavors:\nMiami Mint: A chillingly smooth and refreshing mint.\nBangin Sour Berries: A sharp, tangy explosion of mixed berry goodness.\nBlueberry Watermelon: A sweet, juicy fusion of summer favorites.\nWatermelon Ice: Crisp watermelon with a freezing menthol finish.",
    "images": [
      "images/products/fooger/fooger1.jfif",
      "images/products/fooger/fooger2.jpeg",
      "images/products/fooger/fooger3.jpeg",
      "images/products/fooger/fooger4.jpeg",
      "images/products/fooger/fooger5.jpeg",
      "images/products/fooger/fooger6.jpeg",
      "images/products/fooger/fooger7.jpeg"
    ],
    "rating": 4.9,
    "onSale": true,
    "isNew": true
  },
  {
    "id": "p5",
    "name": "RAZ LTX 30000 Disposable Vape | 30K Puffs | Mega HD Animated Screen | Premium Leather Grip",
    "category": "Disposables",
    "description": "Experience the Evolution of Vaping: The 30,000 Puff Titan\nStep into the future with the longest-lasting disposable vape on the market. Engineered for those who demand performance, style, and longevity, the RAZ LTX 30000 combines a massive e-liquid reservoir with industry-leading smart technology. Wrapped in a premium genuine leather grip, it offers a luxurious feel that matches its powerful performance.\n\nDual-Mode Performance\nCustomize your hit with a simple toggle:\n\nNormal Mode (30,000 Puffs): Optimized for consistent, smooth flavor and maximum longevity.\n\nBoost Mode (18,000 Puffs): Activates dual mesh coils for intensified flavor and massive vapor production.\n\nMega HD Animated Display\nThe largest screen ever seen on a disposable! This high-definition interface provides more than just data; it provides an experience:\n\nVape Animations: Stunning HD graphics that change while you puff.\n\nJuice & Battery Levels: Never guess your remaining levels again with precise percentage tracking.\n\nCharging Status: Real-time feedback when plugged into a USB-C fast charger.\n\nKey Specifications\nPuff Count: Up to 30,000 Puffs (Normal Mode) / 18,000 Puffs (Boost Mode)\n\nE-Liquid Capacity: Extra-Large Reservoir\n\nNicotine Strength: 5% (50mg)\n\nBattery: 800mAh High-Density Rechargeable\n\nCoil System: Advanced Dual Mesh Coil for superior flavor clarity\n\nCharging: Type-C Fast Charge Port\n\nAvailable Premium Flavors\nBangin Sour Berries: A sharp, tart mix of wild forest berries.\n\nMiami Mint: A crisp, refreshing, and icy spearmint.\n\nBlueberry Watermelon: The perfect balance of sweet summer fruits.\n\nWintergreen: A bold, cool blast of classic wintergreen freshness.",
    "images": [
      "images/products/tyson30/tyson1.jpeg",
      "images/products/tyson30/tyson2.jpeg",
      "images/products/tyson30/tyson3.jpeg",
      "images/products/tyson30/tyson4.jpeg",
      "images/products/tyson30/tyson5.jpeg"
    ],
    "rating": 4.8,
    "onSale": true,
    "isNew": true
  },
  {
    "id": "p6",
    "name": "RAZ DC25000 Disposable Vape | 15,000 Puffs (Boost Mode) | Mega HD Screen | Genuine Leather Grip",
    "category": "Disposables",
    "description": "Unlock Maximum Power with the RAZ DC25000 Boost Edition The RAZ DC25000 is a premium, high-performance disposable vape designed for those who refuse to compromise on flavor intensity. Featuring a luxurious genuine leather wrap and a transparent outer shell, this device offers a sophisticated aesthetic alongside cutting-edge technology.\n\nOptimized for 15,000 Puffs of Pure Flavor\nWhile this device can reach 25,000 puffs in Regular Mode, the Boost Mode is where it truly shines. By switching to Boost (24W), the device activates its enhanced dual-core technology to deliver:\n\nRich Flavor: 15,000 puffs of intensified, bold taste.\n\nDense Vapor: Maximum cloud production for a satisfying hit every time.\n\nAdvanced Mesh Coils: Integrated 1.0Ω mesh coil technology ensures a smooth and consistent draw.\n\nMega HD Smart Screen\nStay informed with the industry-leading 1.77-inch HD display. This interactive screen provides real-time updates and stylish visuals, including:\n\nE-Liquid Level Indicator: Know exactly when your 16mL reservoir is running low.\n\nBattery Life Monitor: Track the 800mAh battery for timely recharging via USB-C.\n\nDynamic Animations: High-quality graphics like fire and gear animations that activate as you vape.\n\nKey Specifications\nPuff Count: 15,000 Puffs (Boost Mode) / 25,000 Puffs (Regular Mode).\n\nNicotine Strength: 5% (50mg) salt nicotine for a perfect throat hit.\n\nModes: One-click toggle between Light and Dark display modes.\n\nAirflow: Stepless adjustable airflow control on the bottom of the device.\n\nBattery: 800mAh rechargeable (USB-C port).\n\nPopular Flavors Shown:\nBangin Sour Berries: A sharp, tangy berry explosion.\n\nMiami Mint: A crisp, tropical-inspired cool mint.\n\nBlueberry Watermelon: A juicy, sweet fruit fusion.",
    "images": [
      "images/products/tyson15/tyson1.jpeg",
      "images/products/tyson15/tyson2.jpeg",
      "images/products/tyson15/tyson3.jpeg",
      "images/products/tyson15/tyson4.jpeg"
    ],
    "rating": 4.7,
    "onSale": true,
    "isNew": true
  },
  {
    "id": "p7",
    "name": "RAZ DC25000 / LTX Edition Disposable Vape (15,000–25,000 Puffs)",
    "category": "Disposables",
    "description": "The Ultimate Luxury Vaping Experience: RAZ DC25000 Redefine your vaping journey with the RAZ DC25000, a high-performance disposable that merges cutting-edge technology with premium design. Encased in a genuine leather-wrapped grip and a transparent protective shell, this device feels as good as it performs.\n\nDual Vaping Modes for Precision Control\nToggle between two distinct power settings with a single click to match your mood:\n\nBoost Mode (15,000 Puffs): Operates at 24 watts for intensified flavor and massive vapor clouds.\n\nRegular Mode (25,000 Puffs): Operates at 12 watts for a smoother, consistent draw that lasts for weeks.\n\nIndustry-Leading Mega HD Screen\nStay fully informed with the 1.77-inch Mega HD smart screen, the largest in its class. The vibrant interface includes:\n\nE-Liquid & Battery Indicators: Precise percentage tracking so you never run out unexpectedly.\n\nVaping Animations: Interactive \"Fire\" and \"Gear\" animations that play while you draw.\n\nDisplay Customization: Choose between Light and Dark modes to suit your environment.\n\nKey Performance Features\nAdvanced Mesh Coils: Features temperature-controlled dual-mesh technology for pure flavor and zero burnt hits.\n\nAdjustable Airflow: A stepless airflow control valve on the base allows you to fine-tune your draw from a tight MTL to a loose DTL.\n\nHigh-Capacity Power: Powered by an 800mAh battery with USB-C fast charging.\n\n5% (50mg) Nicotine Strength: Delivers a satisfying, smooth throat hit with every puff.",
    "images": [
      "images/products/Airbar/air1.jpeg",
      "images/products/Airbar/air2.jpeg",
      "images/products/Airbar/air3.jpeg",
      "images/products/Airbar/air4.jpeg",
      "images/products/Airbar/air5.jpeg",
      "images/products/Airbar/air6.jpeg",
      "images/products/Airbar/air7.jpeg",
      "images/products/Airbar/air8.jpeg",
      "images/products/Airbar/air9.jpeg"
    ],
    "rating": 4.6,
    "onSale": true,
    "isNew": true
  },
  {
    "id": "p8",
    "name": "Cali Bars 2K Disposable Vape (2,000 Puffs)",
    "category": "Disposables",
    "description": "Pure Simplicity with Cali Bars 2K The Cali Bars 2K is a cult favorite known for its sleek, \"stick-style\" design and ultra-reliable performance. Perfect for vapers who want a consistent, pocket-friendly device without the need for charging or complicated screens, it delivers the signature \"California Grown\" flavor experience in a compact form.\n\nReliable Daily Performance\nDesigned for ease of use, the Cali Bars 2K is ready to go right out of the box:\n\n2,000 Puffs: A high-capacity reservoir and optimized battery provide roughly 2,000 smooth hits.\n\nCompact \"Stick\" Design: Slim enough to fit in any pocket or small bag, making it the ideal travel companion.\n\nNo Maintenance Required: No charging ports, no buttons, and no refills—simply vape and dispose of when finished.\n\nKey Features\nPuff Count: Approximately 2,000 Puffs.\n\nE-Liquid Capacity: 5ml of premium nicotine salt.\n\nNicotine Strength: 5% (50mg) for a strong, satisfying hit.\n\nBattery: Integrated pre-charged battery designed to last the full duration of the e-liquid.\n\nCoil: Quality mesh/wire coil for instant vapor production.\n\nBest-Selling Flavors\nBlue Razz: A sweet and tart blue raspberry classic.\n\nWatermelon Ice: Juicy watermelon with a refreshing menthol finish.\n\nStrawberry Ice: Sweet vine-ripened strawberries with a cool exhale.\n\nSweet Mint: A crisp, clean, and icy mint flavor.",
    "images": [
      "images/products/cali2000/cali1 (1).jpeg",
      "images/products/cali2000/cali2.jpeg",
      "images/products/cali2000/cali3.jpeg",
      "images/products/cali2000/cali4.jpeg"
    ],
    "rating": 4.4,
    "onSale": true,
    "isNew": true
  }
]
